FactoryGirl.define do
  factory :article do
    topic
    title "重构我的思维我的心——初衷"
    initial_published { 2.years.ago }
    body "很清楚地记得，是初二那年，像是突然学会思考。
     变得很迷惘。想探索而不得。
     也许是很虚无的问题，却很想知道答案。

     比如，人活着是为什么。
     比如，什么叫成功。
     比如，我是谁，我想要成为怎样的自己，我想要怎样的人生。

     父母忙于生计，同时也没有足够的能力给我答案。
     也没有哥哥姐姐等比我更成熟的人。
     我只能从书中寻找答案。

     不得不说，这就是我遇到困惑最习惯的解决方法。
     去读书。

     我喜欢清晰的一切。
     大概十八岁的时候我已经有了答案。
     有了非常坚定明确的价值观与世界观、爱情观。
     二十五岁的时候，我写了一个人生计划书。
     里面清晰地描述了我所追求的人生，我想要的自己。
     我想余生，我都不遗余力地去执行，努力去实现。

     对我来说，目标是不变的。
     六岁时，我已经想要创业。（当然，当时并不是这个名词，但我了解自己的意思）
     十二岁时，我已经追求一生一恋。

     但路径是可变的。
     条条大路通罗马。
     保持灵活和弹性，心放开。

     其实我曾一度，为实现每个目标，规划了一个时间点。
     直到现在，所有时间点已过，尚未实现。

     我反思了两点：
     一是路径往往是不能规划的，你无法看到一万步以后的障碍是什么，你也无法把控实现时间。
     二是也许我前行的方式有问题，走了很多弯路，也走得很慢。大方向没有错，但一些十字路口没有选对。

     要多给自己一点点时间，多一点点耐心。
     也要调整一些小的方向，一些策略，一些技巧，一些行走的方式，一些解决问题的方法。

     我在寻找自己的盲点和思维误区。"
    abstract " 用一个月，全心整理我的内在状态与外在境况。
    境由心生。我需要由内至外的改变。
    我感觉到自己在成长。"

  end
end